brew 'ripgrep'
brew 'fzf'
brew 'starship'
brew 'eza'
brew 'zoxide'
brew 'jq'
brew 'zsh-autosuggestions'
brew 'zsh-autocomplete'
brew 'zsh-syntax-highlighting'
brew 'fish'
brew 'tree'
brew 'lazygit'
brew 'difftastic'
brew 'git-delta'

brew 'duckdb'

cask 'wezterm'
cask 'warp'

cask 'zed'
brew 'neovim'

brew 'go'
brew 'rust'

cask 'raycast'
