brew 'ripgrep'
brew 'fzf'
brew 'starship'
brew 'eza'
brew 'zoxide'
brew 'jq'
brew 'fish'
brew 'tree'
brew 'lazygit'
brew 'difftastic'
brew 'git-delta'
brew 'ruff'
brew 'rust-analyzer'

brew 'duckdb'

cask 'ghostty'
cask 'wezterm'

cask 'zed'
cask 'cursor'

brew 'go'
brew 'rust'

cask 'raycast'

cask 'claude'
